package filosofia.java.p184.enum_test;

/* Создайте перечисление
 * с шестью видами бумажных денег.
 * Переберите результат values() с выводом каждого значения и его ordinal().
 */
public class Main {
    public static void main(String[] args) {
     //   for (Money m : Money.values()) {
    //        System.out.println(m + " " + m.ordinal());
    //    }

        Tour t1 = new Tour(Country.JAPAN, 12);
        Tour t2 = new Tour(Country.GREAT_BRITAIN,10);

    }


}
